ci/lambda_solved_mutations/m4_erasure_ignores_iter_backing.patch
diff --git a/src/postcheck/lambda_solved/solve.zig b/src/postcheck/lambda_solved/solve.zig
--- a/src/postcheck/lambda_solved/solve.zig
+++ b/src/postcheck/lambda_solved/solve.zig
@@ -1179,7 +1179,7 @@
             .link => Common.invariant("Lambda Solved root returned a link"),
             .unbound, .forall, .primitive, .zst, .erased => {},
             .func => |func| {
-                if (in_iter_backing) {
+                if (false) { // seeded mutation: ignore the iterator-backing exemption
                     try self.markErasedCallablesReachedByTypeInner(func.callable, active, false);
                 } else {
                     const erased = try self.program.types.add(.{ .erased = .{
